In [1]:
import pandas as pd

In [2]:
adf = pd.read_csv('../data/LFS-1997-100%-Data.csv', index_col=0)

/home/asitha/anaconda3/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3057: DtypeWarning: Columns (6) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
adf.head()

,MONTH,SECTOR,DISTRICT,PSU_NO,HH_NO,BLANK,RES_1,RES_2,RES_3,TIME_1,...,Q36_AVAILABLE_FOR_WORK,Q37_LOOKING_FOR_WORK_IN_EACH,Q38_THIS_PERSON_WAS,Q39_MAIN_OCCUPATION,Q40A_MULTIPLY_WAGE_DAYS_WORKED,Q40B_ANY_PAYMENTS_IN_KIND,Q41_EMPLOYER_THE_SECONDARY_ACTIV,Q42A_EARNING_FROM_SECOND_JOB,Q42B_ANY_PAYMENTS_IN_KIND,INFLATION_FACTOR
YEAR,,,,,,,,,,,,,,,,,,,,,
1997,1,1,1,37,1,1,1,,,30,...,,,1,1,8000,1,2,,,237.8926
1997,1,1,1,37,1,2,1,,,30,...,2,,3,2,,,2,,,237.8926
1997,1,1,1,37,1,3,1,,,30,...,2,,3,2,,,2,,,237.8926
1997,1,1,1,37,1,4,1,,,30,...,2,,3,2,,,2,,,237.8926
1997,1,1,1,37,1,5,1,,,30,...,,,,,,,,,,237.8926

In [4]:
ages = []
count = []
age_arr = list(adf.P5_AGE)
age_cat = []
inflation_factor = list(adf.INFLATION_FACTOR)
for i in range(len(age_arr)):
    age = age_arr[i]
    if(age>60):
        age_cat.append(3)
    elif(age>15):
        age_cat.append(2)
    else:
        age_cat.append(1)
    if(age not in ages):
        ages.append(age)
        count.append(inflation_factor[i])
    else:
        age_pos = ages.index(age)
        age_count_val = count[age_pos]
        total = age_count_val+inflation_factor[i]
        age_poss = [j for j, x in enumerate(ages) if x == age]
        for j in age_poss:
            count[j]=total
        ages.append(age)
        count.append(total)
        
# ages.sort()
# print(ages)
# print(count)
new_inf = pd.Series(count, name='INFLATION_FACTOR')

In [5]:
adf.update(new_inf)
adf.head()

,MONTH,SECTOR,DISTRICT,PSU_NO,HH_NO,BLANK,RES_1,RES_2,RES_3,TIME_1,...,Q36_AVAILABLE_FOR_WORK,Q37_LOOKING_FOR_WORK_IN_EACH,Q38_THIS_PERSON_WAS,Q39_MAIN_OCCUPATION,Q40A_MULTIPLY_WAGE_DAYS_WORKED,Q40B_ANY_PAYMENTS_IN_KIND,Q41_EMPLOYER_THE_SECONDARY_ACTIV,Q42A_EARNING_FROM_SECOND_JOB,Q42B_ANY_PAYMENTS_IN_KIND,INFLATION_FACTOR
YEAR,,,,,,,,,,,,,,,,,,,,,
1997,1,1,1,37,1,1,1,,,30,...,,,1,1,8000,1,2,,,234393.4436
1997,1,1,1,37,1,2,1,,,30,...,2,,3,2,,,2,,,234393.4436
1997,1,1,1,37,1,3,1,,,30,...,2,,3,2,,,2,,,234393.4436
1997,1,1,1,37,1,4,1,,,30,...,2,,3,2,,,2,,,234393.4436
1997,1,1,1,37,1,5,1,,,30,...,,,,,,,,,,234393.4436

In [6]:
adf['AGE_CATEGORY'] = age_cat

In [7]:
adf.head()

,MONTH,SECTOR,DISTRICT,PSU_NO,HH_NO,BLANK,RES_1,RES_2,RES_3,TIME_1,...,Q37_LOOKING_FOR_WORK_IN_EACH,Q38_THIS_PERSON_WAS,Q39_MAIN_OCCUPATION,Q40A_MULTIPLY_WAGE_DAYS_WORKED,Q40B_ANY_PAYMENTS_IN_KIND,Q41_EMPLOYER_THE_SECONDARY_ACTIV,Q42A_EARNING_FROM_SECOND_JOB,Q42B_ANY_PAYMENTS_IN_KIND,INFLATION_FACTOR,AGE_CATEGORY
YEAR,,,,,,,,,,,,,,,,,,,,,
1997,1,1,1,37,1,1,1,,,30,...,,1,1,8000,1,2,,,234393.4436,2
1997,1,1,1,37,1,2,1,,,30,...,,3,2,,,2,,,234393.4436,2
1997,1,1,1,37,1,3,1,,,30,...,,3,2,,,2,,,234393.4436,1
1997,1,1,1,37,1,4,1,,,30,...,,3,2,,,2,,,234393.4436,1
1997,1,1,1,37,1,5,1,,,30,...,,,,,,,,,234393.4436,1

In [11]:
adf.to_csv('../data/age_structure_1997.csv')